<a href="https://colab.research.google.com/github/plthiyagu/AI-Engineering/blob/master/03-Pandas/Pandas_Play.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://www.analyticsvidhya.com/blog/2021/07/pandas-a-hands-on-guide-for-beginners/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+AnalyticsVidhya+%28Analytics+Vidhya%29

In [1]:
import pandas as pd

In [2]:
# A pandas series 
pd.Series( [ 12, 13, 1, 3, 5 ] )

0    12
1    13
2     1
3     3
4     5
dtype: int64

In [3]:
# A pandas series with explicit indexing 
pd.Series( [ 2,  4,  6],  index = [ 'ad',  'bd',  'cd' ] )

ad    2
bd    4
cd    6
dtype: int64

In [6]:
# A pandas dataframe 
df=pd.DataFrame({'name': ['Akash', 'Shivam', 'Neil', 'Manish'], 'age': [21, 23, 24, 28],'occupation': ['data scientist',  'doctor',  'data analyst', 'engineer']})

In [8]:
# sorting the dataframe by index
df.sort_index(axis = 0,  ascending = False)

     name  age      occupation
3  Manish   28        engineer
2    Neil   24    data analyst
1  Shivam   23          doctor
0   Akash   21  data scientist

In [11]:
 # sorting the data frame by a column
df.sort_values(by ='name', ascending = False)

     name  age      occupation
1  Shivam   23          doctor
2    Neil   24    data analyst
3  Manish   28        engineer
0   Akash   21  data scientist

In [12]:
#Viewing top 5 rows of the data frame
df.head() 
#One can view any number of top rows by
df.head(3)
df.head(15)

     name  age      occupation
0   Akash   21  data scientist
1  Shivam   23          doctor
2    Neil   24    data analyst
3  Manish   28        engineer

In [13]:
#viewing bottom 5 rows
df.tail()
#One can view any number of bottom number
df.tail(10)

     name  age      occupation
0   Akash   21  data scientist
1  Shivam   23          doctor
2    Neil   24    data analyst
3  Manish   28        engineer

In [14]:
# metadata summary 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        4 non-null      object
 1   age         4 non-null      int64
 2   occupation  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [15]:
# statistical summary 
df.describe()

            age
count   4.00000
mean   24.00000
std     2.94392
min    21.00000
25%    22.50000
50%    23.50000
75%    25.00000
max    28.00000

In [16]:
#Returns the memory consumed by columns 
df.memory_usage()

Index         128
name           32
age            32
occupation     32
dtype: int64

In [17]:
#Returns the columns of the data frame as a array
df.columns

Index(['name', 'age', 'occupation'], dtype='object')

In [19]:
#Returns the values as an array 
df.values

array([['Akash', 21, 'data scientist'],
       ['Shivam', 23, 'doctor'],
       ['Neil', 24, 'data analyst'],
       ['Manish', 28, 'engineer']], dtype=object)

In [20]:
# Extract a specific column as a series
df[ 'name' ]

0     Akash
1    Shivam
2      Neil
3    Manish
Name: name, dtype: object

In [21]:
df.occupation

0    data scientist
1            doctor
2      data analyst
3          engineer
Name: occupation, dtype: object

In [22]:
#Extracting multiple columns at a time 
df[ [ 'name',  'occupation'] ]

     name      occupation
0   Akash  data scientist
1  Shivam          doctor
2    Neil    data analyst
3  Manish        engineer

In [24]:
df = pd.DataFrame( {
    'Name' : ['Neil', 'Aishwarya', 'Rahul', 'Shivani','Namrata','Pawan', 'Karan','Krish'],
    'Age' : [23, 21, 22, 21, 20, 22, 22, 23],
    'University' : ['BHU', 'JNU', 'DU', 'BHU', 'IIT', 'MU', 'JNU', 'MU'],
    'Specialization' : ['Mathematics' , 'Biology', 'Physics' , 'Chemistry', 'Accountancy', 'Mathematics', 'Bio-Chemistry', 'Astrophysics']})

In [29]:
# Extracting a particular column and row from dataframe. dataframe.iloc[m,n] where m is row index and n is column index 
df.iloc[3, 2]   # single element 4throw and 6th column

'BHU'

In [30]:
#Extracting a specific row with all columns 
df.iloc[5, :] # single row and all columns

Name                    Pawan
Age                        22
University                 MU
Specialization    Mathematics
Name: 5, dtype: object

In [31]:
#Extracting multiple rows at a time by providing list of indices
df.iloc[ [2, 5, 7] ]
#df.iloc[ [2, 5, 7] , : ] 
#df.iloc[ [2, 5, 7] ,  ]

    Name  Age University Specialization
2  Rahul   22         DU        Physics
5  Pawan   22         MU    Mathematics
7  Krish   23         MU   Astrophysics

In [32]:
#Extracting particular range of rows
df.iloc[2 : 8] 
df.iloc[2 : 8 ,  : ]
df.iloc[2 : 8 , ]

      Name  Age University Specialization
2    Rahul   22         DU        Physics
3  Shivani   21        BHU      Chemistry
4  Namrata   20        IIT    Accountancy
5    Pawan   22         MU    Mathematics
6    Karan   22        JNU  Bio-Chemistry
7    Krish   23         MU   Astrophysics

In [33]:
#Extracting  a particular column by index number
df.iloc[ : ,  2 ]

0    BHU
1    JNU
2     DU
3    BHU
4    IIT
5     MU
6    JNU
7     MU
Name: University, dtype: object

In [34]:
#Extracting particular range of columns
df.iloc[ : , 1 : 3 ]

   Age University
0   23        BHU
1   21        JNU
2   22         DU
3   21        BHU
4   20        IIT
5   22         MU
6   22        JNU
7   23         MU

In [35]:
#Extracting rows and columns of a particular range
df.iloc[ 3 : 6 , 1 : 3 ]

   Age University
3   21        BHU
4   20        IIT
5   22         MU

In [36]:
#Extracting rows and columns based on column or row labels
df.loc[2, 'University'] # single element row label 2 and column sales

'DU'

In [37]:
df.loc[5] # single row with label 5 
df.loc[5, :] # single row with label 5 and all columns

Name                    Pawan
Age                        22
University                 MU
Specialization    Mathematics
Name: 5, dtype: object

In [38]:
#Extracting multiple rows provided the list of labels
df.loc[ [2, 5, 7] ] # rows with label 5, 7, 8 
# Extracting multiple rows with label 3, 7, 8 and all columns
df.loc[ [2, 5, 7],  : ]

    Name  Age University Specialization
2  Rahul   22         DU        Physics
5  Pawan   22         MU    Mathematics
7  Krish   23         MU   Astrophysics

In [39]:
#Extracting the rows of a particular range of labels
df.loc[ 2 : 8 ] # multiple rows using a range of labels 
df.loc[ 2 : 8 ,  ]
# multiple rows using a range of labels and all columns
df.loc[ 2 : 8 ,  : ]

      Name  Age University Specialization
2    Rahul   22         DU        Physics
3  Shivani   21        BHU      Chemistry
4  Namrata   20        IIT    Accountancy
5    Pawan   22         MU    Mathematics
6    Karan   22        JNU  Bio-Chemistry
7    Krish   23         MU   Astrophysics

In [40]:
# Extracting multiple rows using labels and columns
df.loc[ [1,  2] ,  'Name' : 'University']

        Name  Age University
1  Aishwarya   21        JNU
2      Rahul   22         DU

In [41]:
#Extracting all the values in column whose value is greater than 22
df.loc[ df.Age>  22] 
df[ df.Age> 22]

    Name  Age University Specialization
0   Neil   23        BHU    Mathematics
7  Krish   23         MU   Astrophysics

In [42]:
#Extracting all the rows for which age in column are equal to 22
df.loc[ (df.Age== 22) ,  : ]

    Name  Age University Specialization
2  Rahul   22         DU        Physics
5  Pawan   22         MU    Mathematics
6  Karan   22        JNU  Bio-Chemistry

In [43]:
 #Extracting all the rows for which age in column are not equal to 22
df.loc[(df.Age != 22), :]

        Name  Age University Specialization
0       Neil   23        BHU    Mathematics
1  Aishwarya   21        JNU        Biology
3    Shivani   21        BHU      Chemistry
4    Namrata   20        IIT    Accountancy
7      Krish   23         MU   Astrophysics

In [44]:
#Extracting  all rows where 21< Age< 23 and University = MU
df.loc[ ( df.Age > 21) & ( df.Age < 23) & ( df.University == 'MU' ) ,  : ]

    Name  Age University Specialization
5  Pawan   22         MU    Mathematics

In [46]:
#Extract all rows where 22 > Age or University = 'MU'
df.loc[(df.Age < 22) | (df.University == 'MU'), :]

        Name  Age University Specialization
1  Aishwarya   21        JNU        Biology
3    Shivani   21        BHU      Chemistry
4    Namrata   20        IIT    Accountancy
5      Pawan   22         MU    Mathematics
7      Krish   23         MU   Astrophysics

In [48]:
#Extracting the all the rows where column having the values in list
df.loc[ df[ 'University' ].isin( ['MU', 'IIT'] ) ,  : ]

      Name  Age University Specialization
4  Namrata   20        IIT    Accountancy
5    Pawan   22         MU    Mathematics
7    Krish   23         MU   Astrophysics

In [51]:
# Extract all rows where 21< age and University = MU and only selected columns
df.loc[ ( df.Age > 21 ) & ( df.University == 'MU'),[ 'Name', 'Specialization'] ]

    Name Specialization
5  Pawan    Mathematics
7  Krish   Astrophysics

In [52]:
data_1 = pd.DataFrame(
       {
            "key_1": ["K0", "K0", "K1", "K2"],
            "key_2": ["K0", "K1", "K0", "K1"],
            "A": ["A0", "A1", "A2", "A3"],
            "B": ["B0", "B1", "B2", "B3"],
       }
    )
data_2 = pd.DataFrame(
       {
            "key_1": ["K0", "K1", "K1", "K2"],
            "key_2": ["K0", "K0", "K0", "K0"],
            "C": ["C0", "C1", "C2", "C3"],
            "D": ["D0", "D1", "D2", "D3"],
        }
    )

In [54]:
#Merging the two dataframesby inner join on particular columns
pd.merge( data_1,  data_2,  how = 'inner' ,  on = ['key_1',  'key_2' ] )

  key_1 key_2   A   B   C   D
0    K0    K0  A0  B0  C0  D0
1    K1    K0  A2  B2  C1  D1
2    K1    K0  A2  B2  C2  D2

In [57]:
# concatenating dataframes one on top of the other
pd.concat( [ data_1,  data_2], axis = 0)

  key_1 key_2    A    B    C    D
0    K0    K0   A0   B0  NaN  NaN
1    K0    K1   A1   B1  NaN  NaN
2    K1    K0   A2   B2  NaN  NaN
3    K2    K1   A3   B3  NaN  NaN
0    K0    K0  NaN  NaN   C0   D0
1    K1    K0  NaN  NaN   C1   D1
2    K1    K0  NaN  NaN   C2   D2
3    K2    K0  NaN  NaN   C3   D3

In [58]:
# concatenate two dataframes side by side
pd.concat( [ data_1, data_2] , axis = 1 )

  key_1 key_2   A   B key_1 key_2   C   D
0    K0    K0  A0  B0    K0    K0  C0  D0
1    K0    K1  A1  B1    K1    K0  C1  D1
2    K1    K0  A2  B2    K1    K0  C2  D2
3    K2    K1  A3  B3    K2    K0  C3  D3

In [60]:
# adding a new column
df['new_col'] = 5
df

        Name  Age University Specialization  new_col
0       Neil   23        BHU    Mathematics        5
1  Aishwarya   21        JNU        Biology        5
2      Rahul   22         DU        Physics        5
3    Shivani   21        BHU      Chemistry        5
4    Namrata   20        IIT    Accountancy        5
5      Pawan   22         MU    Mathematics        5
6      Karan   22        JNU  Bio-Chemistry        5
7      Krish   23         MU   Astrophysics        5

In [62]:
# add a new column by using existing columns
df[ 'new_col_2' ] = df[ 'Age' ] / df[ 'new_col' ]
df

        Name  Age University Specialization  new_col  new_col_2
0       Neil   23        BHU    Mathematics        5        4.6
1  Aishwarya   21        JNU        Biology        5        4.2
2      Rahul   22         DU        Physics        5        4.4
3    Shivani   21        BHU      Chemistry        5        4.2
4    Namrata   20        IIT    Accountancy        5        4.0
5      Pawan   22         MU    Mathematics        5        4.4
6      Karan   22        JNU  Bio-Chemistry        5        4.4
7      Krish   23         MU   Astrophysics        5        4.6

In [70]:
# grouping the data by specific columns
df.groupby( [ 'University'])  [['new_col','new_col_2']].sum() 
#Grouping the data by specific columns and aggregating 
#df.groupby( [ 'col_1' ,  'col_2' ] )['col_3'].sum() 
#df.groupby( [ 'col_1' ,  'col_2' ] )['col_3'].mean()

            new_col  new_col_2
University
BHU              10        8.8
DU                5        4.4
IIT               5        4.0
JNU              10        8.6
MU               10        9.0

In [73]:
import numpy as np
df['new_col_3']=df[ 'Age' ].apply( lambda x: np.log(x) ) #Invuilt function

In [74]:
df.pivot_table( values = 'new_col_3', index = 'University', columns = 'Specialization', aggfunc = 'mean')

Specialization  Accountancy  Astrophysics  ...  Mathematics   Physics
University                                 ...
BHU                     NaN           NaN  ...     3.135494       NaN
DU                      NaN           NaN  ...          NaN  3.091042
IIT                2.995732           NaN  ...          NaN       NaN
JNU                     NaN           NaN  ...          NaN       NaN
MU                      NaN      3.135494  ...     3.091042       NaN

[5 rows x 7 columns]